In [1]:
import pandas as pd

# Removing duplicates

`.drop_duplicates()`

In [2]:
# sample data frame
df = pd.DataFrame({
    "Name": ["Onkar", "Amit", "Sara", "Amit", "Sara"],
    "City": ["Pune", "Mumbai", "Nashik", "Mumbai", "Nagpur"],
    "Age": [21, 25, 23, 25, 23]
})

df

    Name    City  Age
0  Onkar    Pune   21
1   Amit  Mumbai   25
2   Sara  Nashik   23
3   Amit  Mumbai   25
4   Sara  Nagpur   23

## 1. Find duplicate rows

`.duplicated()` -> Returns True for that rows which are repeated

In [4]:
df.duplicated()

0    False
1    False
2    False
3     True
4    False
dtype: bool

## 2. Count duplicates

`.duplicated().sum()` -> Returns the count of duplicate rows

In [5]:
df.duplicated().sum()

np.int64(1)

## 3. Remove duplicate rows

`.drop_duplicates()` -> Remove duplicate rows and return a clean DataFrame without duplicate rows

In [7]:
df.drop_duplicates()

    Name    City  Age
0  Onkar    Pune   21
1   Amit  Mumbai   25
2   Sara  Nashik   23
4   Sara  Nagpur   23

The 3rd row is droped which is duplicate in original df

## 4. Remove duplicates based on specific columns

In [13]:
df.drop_duplicates(subset=["City"]), df.drop_duplicates(subset=["Name"])

(    Name    City  Age
 0  Onkar    Pune   21
 1   Amit  Mumbai   25
 2   Sara  Nashik   23
 4   Sara  Nagpur   23,
     Name    City  Age
 0  Onkar    Pune   21
 1   Amit  Mumbai   25
 2   Sara  Nashik   23)

To keep last occurrence use `keep='last'`, First is default.  
Options for keep: 
1. "first" - Default
2. "last" - Keeps last occurrence and drops all above duplicates
3. False - remove all rows which are duplicates

Below ex to understand `keep=False`.  
On the basis on name `keep=False` removed all rows which are duplicates.  
Nither first nor last occurrence is keeped.

In [22]:
df.drop_duplicates(subset=["Name"], keep=False)

    Name  City  Age
0  Onkar  Pune   21

## 5. Remove all duplicates (keep none)

In [23]:
df.drop_duplicates(keep=False)

    Name    City  Age
0  Onkar    Pune   21
2   Sara  Nashik   23
4   Sara  Nagpur   23

## 6. Remove in-place

In [ ]:
# df.drop_duplicates(inplace=True)

## 7. Drop duplicates + reset index

In [28]:
df.drop_duplicates().reset_index()

   index   Name    City  Age
0      0  Onkar    Pune   21
1      1   Amit  Mumbai   25
2      2   Sara  Nashik   23
3      4   Sara  Nagpur   23

In [30]:
df.drop_duplicates().reset_index(drop=True)
# drop=True -> Drops the old index

    Name    City  Age
0  Onkar    Pune   21
1   Amit  Mumbai   25
2   Sara  Nashik   23
3   Sara  Nagpur   23